---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentSymbolicLine
source: html/46e2c8c2-7346-9ea0-13dc-d497a172181d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentSymbolicLine Property

While making curved beam type "[Type Name]" some Symbolic Line elements were not created

## Syntax (C#)
```csharp
public static FailureDefinitionId NotBentSymbolicLine { get; }
```